results/mpi_benchmark/sysbench_fio/fio_cephfs/oc_sys-fio_cephfs.worker07_1threads.5/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     527.46
    fsyncs/s:                     684.80

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               8.24

General statistics:
    total time:                          10.0470s
    total number of events:              12053

Latency (ms):
         min:                                    0.00
         avg:                                    0.83
         max:                                    9.80
         95th percentile:                        2.91
         sum:                                 9988.87

Threads fairness:
    events (avg/stddev):           12053.0000/0.00
    execution time (avg/stddev):   9.9889/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      981.15
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  15.33
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0014s
    total number of events:              9814

Latency (ms):
         min:                                    0.00
         avg:                                    1.02
         max:                                   11.47
         95th percentile:                        1.55
         sum:                                 9985.82

Threads fairness:
    events (avg/stddev):           9814.0000/0.00
    execution time (avg/stddev):   9.9858/0.00

DONE